cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/cask-versions'

# brew install
brew 'node'
brew 'awscli'
brew 'git'
brew 'python3'
brew 'ruby'
brew 'yarn'
brew 'postgresql'
brew 'mongodb'
brew 'wifi-password'
brew 'nvm'
brew 'fish'
brew 'glslviewer'

# Cask installs

# General Apps
cask 'google-chrome'
cask 'google-chrome-dev'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'safari-technology-preview'
cask 'dropbox'
cask 'bartender'
cask '1password'
cask 'spotify'
cask 'slack'
cask 'transmission'
cask 'little-snitch'
cask 'linkliar'
cask 'vlc'
cask 'grammarly'
cask 'sip'
cask 'droplr'
cask 'cleanmymac3'
cask 'discord'
# Development Apps
cask 'vscode'
cask 'iterm2'
cask 'sourcetree'
cask 'docker'
cask 'kitematic'
cask 'paw'
cask 'postman'
cask 'now'
cask 'dash'
cask 'github'
cask 'graphql-ide'
cask 'gitscout'
cask 'processing2'
# Design Apps
cask 'sketch'
cask 'abstract'
cask 'iconjar'
cask 'adobe-creative-cloud'
cask 'framer'
cask 'framer-x'
cask 'figma'
cask 'rightfont'
cask 'origami-studio'
cask 'principle'
cask 'protopie'
cask 'unity'
cask 'unity-hub'
cask 'unity-ios-support-for-editor'
cask 'unity-standard-assets'
cask 'zeplin'