cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/cask-versions'

# brew install
brew 'node'
brew 'awscli'
brew 'git'
brew 'go'
brew 'python3'
brew 'ruby'
brew 'solidity'
brew 'rust'
brew 'yarn'
brew 'postgresql'
brew 'mongodb'
brew 'wifi-password'
brew 'nvm'
brew 'llvm'
brew 'ninja'
brew 'cmake'
brew 'fish'
brew 'thefuck'

# Cask installs


cask 'google-chrome'
cask 'google-chrome-dev'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'safari-technology-preview'
cask 'alfred'
cask 'bartender'
cask 'spotify'
cask 'slack'
cask 'grammarly'
cask 'discord'
cask 'rectangle'
cask 'obsidian'
cask 'logseq'
cask 'cron'
cask 'superhuman'
cask 'cleanshot'
cask 'loom'

cask 'vscode'
cask 'sourcetree'
cask 'docker'
cask 'kitematic'
cask 'paw'
cask 'dash'
cask 'github'
cask 'iterm2'
cask 'paw'

cask 'adobe-creative-cloud'
cask 'figma'
cask 'rightfont'
cask 'origami-studio'
